In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('employees.csv')
df.head()

   emp_id       emp_name     salary   department joining_date
0       1    Alice Smith  152345.23  Engineering   25-03-2014
1       2      Bob Jones   40211.77      Finance   09-11-2011
2       3  Charlie Brown  115320.55        Sales   17-06-2017
3       4      David Lee    98210.1           HR   03-08-2012
4       5      Eve Patel    73455.9      Support   19-12-2019